Revit 2026 API

# ElementMulticategoryFilter(ICollectionBuiltInCategory, Boolean) Constructor

---

Initializes a new instance of the ElementMulticategoryFilter class

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public ElementMulticategoryFilter(
	ICollection<BuiltInCategory> categories,
	bool inverted
)
```
```vb
Public Sub New (
	categories As ICollection(Of BuiltInCategory),
	inverted As Boolean
)
```
```cpp
public:
ElementMulticategoryFilter(
	ICollection<BuiltInCategory>^ categories,
	bool inverted
)
```
```fsharp
new :
        categories : ICollection<BuiltInCategory> *
        inverted : bool -> ElementMulticategoryFilter
```

#### Parameters

categories ICollectionBuiltInCategory

inverted Boolean

#### Reference

ElementMulticategoryFilter Class

ElementMulticategoryFilter Overload

Autodesk.Revit.DB Namespace